#include <iostream>
 
using namespace std;
 
int main() {
    setlocale(LC_ALL, "RU");

    int year, February, day, i;

    cout << "Введите год: ";
    cin >> year;

    if (year % 4 == 0) {
        if (year % 100 == 0) {
            if (year % 400 == 0) {
                February = 29;
            }
            else {
                February = 28;
            }
        }
        else {
            February = 29;
        }
    }
    else {
        February = 29;
    }

    cout << "Введите какой день недели был 1 января " << year << " года (если понедельник = 1): ";
    cin >> day;
    cout << endl;

    cout << "Январь" << endl << "________________________________________________________" << "\n";
    cout << "|Пн\t|Вт\t|Ср\t|Чт\t|Пт\t|Сб\t|Вс\t|";
    cout << endl;

    for (i = 1; i < day; i++) {
        cout << "| \t";
    }
    for (i = 1; i <= 31; i++) {
        cout << "|" << i << " \t";
        if ((day + i) % 7 == 1) {
            cout << "|" << endl;
        }
    }
    cout << endl;
    cout << "________________________________________________________" << endl;
    day = (day + 31) % 7;
    if (day != 0) {
        day += 0;
    }
    else {
        day += 7;
    }

    cout << "Февраль" << endl << "________________________________________________________" << "\n";
    cout << "|Пн\t|Вт\t|Ср\t|Чт\t|Пт\t|Сб\t|Вс\t|";
    cout << endl;

    for (i = 1; i < day; i++){
        cout << "| \t";
    }
    for (i = 1; i <= February; i++) {
        cout << "|" << i << " \t";
        if ((day + i) % 7 == 1) {
            cout << "|" << endl;
        }
    }
    cout << endl;
    cout << "________________________________________________________" << endl;
    day = (day + February) % 7;
    if (day != 0) {
        day += 0;
    }
    else {
        day += 7;
    }
 
    cout << "Март" << endl << "________________________________________________________" << "\n";
    cout << "|Пн\t|Вт\t|Ср\t|Чт\t|Пт\t|Сб\t|Вс\t|";
    cout << endl;

    for (i = 1; i < day; i++) {
        cout << "| \t";
    }
    for (i = 1; i <= 31; i++) {
        cout << "|" << i << " \t";
        if ((day + i) % 7 == 1) {
            cout << "|" << endl;
        }
    }
 
    cout << endl;
    cout << "________________________________________________________" << endl;
    day = (day + 31) % 7;
    if (day != 0) {
        day += 0;
    }
    else {
        day += 7;
    }

    cout << "Апрель" << endl << "________________________________________________________" << "\n";
    cout << "|Пн\t|Вт\t|Ср\t|Чт\t|Пт\t|Сб\t|Вс\t|";
    cout << endl;

    for (i = 1; i < day; i++) {
        cout << "| \t";
    }
    for (i = 1; i <= 30; i++) {
        cout << "|" << i << " \t";
        if ((day + i) % 7 == 1) {
            cout << "|" << endl;
        }
    }
    cout << endl;
    cout << "________________________________________________________" << endl;
    day = (day + 30) % 7;
    if (day != 0) {
        day += 0;
    }
    else {
        day += 7;
    }

    cout << "Май" << endl << "________________________________________________________" << "\n";
    cout << "|Пн\t|Вт\t|Ср\t|Чт\t|Пт\t|Сб\t|Вс\t|";
    cout << endl;

    for (i = 1; i < day; i++) {
        cout << "| \t";
    }
    for (i = 1; i <= 31; i++) {
        cout << "|" << i << " \t";
        if ((day + i) % 7 == 1) {
            cout << "|" << endl;
        }
    }
    cout << endl;
    cout << "________________________________________________________" << endl;
    day = (day + 31) % 7;
    if (day != 0) {
        day += 0;
    }
    else {
        day += 7;
    }

    cout << "Июнь" << endl << "________________________________________________________" << "\n";
    cout << "|Пн\t|Вт\t|Ср\t|Чт\t|Пт\t|Сб\t|Вс\t|";
    cout << endl;

    for (i = 1; i < day; i++) {
        cout << "| \t";
    }
    for (i = 1; i <= 30; i++) {
        cout << "|" << i << " \t";
        if ((day + i) % 7 == 1) {
            cout << "|" << endl;
        }
    }
    cout << endl;
    cout << "________________________________________________________" << endl;
    day = (day + 30) % 7;
    if (day != 0) {
        day += 0;
    }
    else {
        day += 7;
    }

    cout << "Июль" << endl << "________________________________________________________" << "\n";
    cout << "|Пн\t|Вт\t|Ср\t|Чт\t|Пт\t|Сб\t|Вс\t|";
    cout << endl;

    for (i = 1; i < day; i++) {
        cout << "| \t";
    }
    for (i = 1; i <= 31; i++) {
        cout << "|" << i << " \t";
        if ((day + i) % 7 == 1) {
            cout << "|" << endl;
        }
    }
    cout << endl;
    cout << "________________________________________________________" << endl;
    day = (day + 31) % 7;
    if (day != 0) {
        day += 0;
    }
    else {
        day += 7;
    }

    cout << "Август" << endl << "________________________________________________________" << "\n";
    cout << "|Пн\t|Вт\t|Ср\t|Чт\t|Пт\t|Сб\t|Вс\t|";
    cout << endl;

    for (i = 1; i < day; i++) {
        cout << "| \t";
    }
    for (i = 1; i <= 31; i++) {
        cout << "|" << i << " \t";
        if ((day + i) % 7 == 1) {
            cout << "|" << endl;
        }
    }
    cout << endl;
    cout << "________________________________________________________" << endl;
    day = (day + 31) % 7;
    if (day != 0) {
        day += 0;
    }
    else {
        day += 7;
    }

    cout << "Сентябрь" << endl << "________________________________________________________" << "\n";
    cout << "|Пн\t|Вт\t|Ср\t|Чт\t|Пт\t|Сб\t|Вс\t|";
    cout << endl;

    for (i = 1; i < day; i++) {
        cout << "| \t";
    }
    for (i = 1; i <= 30; i++) {
        cout << "|" << i << " \t";
        if ((day + i) % 7 == 1) {
            cout << "|" << endl;
        }
    }
    cout << endl;
    cout << "________________________________________________________" << endl;
    day = (day + 30) % 7;
    if (day != 0) {
        day += 0;
    }
    else {
        day += 7;
    }

    cout << "Октябрь" << endl << "________________________________________________________" << "\n";
    cout << "|Пн\t|Вт\t|Ср\t|Чт\t|Пт\t|Сб\t|Вс\t|";
    cout << endl;

    for (i = 1; i < day; i++) {
        cout << "| \t";
    }
    for (i = 1; i <= 31; i++) {
        cout << "|" << i << " \t";
        if ((day + i) % 7 == 1) {
            cout << "|" << endl;
        }
    }
    cout << endl;
    cout << "________________________________________________________" << endl;
    day = (day + 31) % 7;
    if (day != 0) {
        day += 0;
    }
    else {
        day += 7;
    }

    cout << "Ноябрь" << endl << "________________________________________________________" << "\n";
    cout << "|Пн\t|Вт\t|Ср\t|Чт\t|Пт\t|Сб\t|Вс\t|";
    cout << endl;

    for (i = 1; i < day; i++) {
        cout << "| \t";
    }
    for (i = 1; i <= 30; i++) {
        cout << "|" << i << " \t";
        if ((day + i) % 7 == 1) 
            cout << "|" << endl;
    }
    cout << endl;
    cout << "________________________________________________________" << endl;
    day = (day + 30) % 7;
    if (day != 0) {
        day += 0;
    }
    else {
        day += 7;
    }

    cout << "Декабрь" << "\n" << "________________________________________________________" << "\n";
    cout << "|Пн\t|Вт\t|Ср\t|Чт\t|Пт\t|Сб\t|Вс\t|";
    cout << endl;

    for (i = 1; i < day; i++) {
        cout << "| \t";
    }
    for (i = 1; i <= 31; i++) {
        cout << "|" << i << " \t";
        if ((day + i) % 7 == 1) { 
            cout << "|" << endl;
        }
    }
    cout << endl;
    cout << "________________________________________________________" << endl;
} 
